import random

def game():
    Famous_people = {"А. С. Пушкин":"26.06.1799", "Михаил Лермонтов":"15.10.1814", "Сергей Александрович Есенин":"03.10.1895", "Владимир Высоцкий":"25.08.1980",
                 "Виктор Цой":"21.06.1962","А. С. Пушкин":"26.06.1799","Михаил Лермонтов":"15.10.1814","Сергей Александрович Есенин":"03.10.1895",
                 "Владимир Высоцкий":"25.08.1980","Виктор Цой":"21.06.1962"}
    print("Привет")
    input('Как тебя зовут? -')
    gotov = input('Готов ли ты?')
    if gotov == "да":
        rounds = int(input("Сколько раз вы хотите играть?"))
        for i in range(rounds):
            name, date = random.choice(list(Famous_people.items()))
            answer = input(f"Когда родился {name}")
            if answer == date:
                print("Верно")
            else:
                print("Неверно")
        print("Пока")
    elif gotov == "нет":
        print("ну готовься")
    else:
        print("че ты написал?")


game()
